Revit 2025 API
CircuitConnectionType Enumeration
 An enumerated type indicates the panel to panel connection type
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum CircuitConnectionType
Public Enumeration CircuitConnectionType
public enum class CircuitConnectionType
type CircuitConnectionType
Members
Member name | Value | Description
NotApplicable | 0 |  NotApplicable.
Breaker | 1 |  Breaker.
FeedThruLugs | 2 |  FeedThruLugs.
See Also
Reference
Autodesk.Revit.DB.Electrical Namespace